import pytest


@pytest.fixture
def get_operations_list___normal___for_investment_bank():
    return [
        {"Дата операции": "2021.03.24", "Сумма операции": -17980.0},
        {"Дата операции": "2021.03.27", "Сумма операции": -534.50},
        {"Дата операции": "2021.03.30", "Сумма операции": -2401.0},
        {"Дата операции": "2021.04.01", "Сумма операции": 750.0},
        {"Дата операции": "2021.04.01", "Сумма операции": 123.0},
        {"Дата операции": "2021.04.04", "Сумма операции": 2105.6},
        {"Дата операции": "2021.04.06", "Сумма операции": 56.6},
        {"Дата операции": "2021.04.07", "Сумма операции": 987.5},
        {"Дата операции": "2021.05.01", "Сумма операции": 3459.5},
        {"Дата операции": "2021.05.02", "Сумма операции": 146.0},
        {"Дата операции": "2021.05.03", "Сумма операции": 977.0},
    ]


@pytest.fixture
def get_operations_list___faulty_sum___for_investment_bank():
    return [
        {"Дата операции": "2021.03.24", "Сумма операции": "-17980.0"},
        {"Дата операции": "2021.03.27", "Сумма операции": -534.50},
        {"Дата операции": "2021.03.30", "Сумма операции": -2401.0},
        {"Дата операции": "2021.04.01", "Сумма операции": 750.0},
        {"Дата операции": "2021.04.01", "Сумма операции": 123.0},
        {"Дата операции": "2021.04.04", "Сумма операции": []},
        {"Дата операции": "2021.04.06", "Сумма операции": 56.6},
        {"Дата операции": "2021.04.07", "Сумма операции": 987.5},
        {"Дата операции": "2021.05.01", "Сумма операции": 3459.5},
        {"Дата операции": "2021.05.02", "Сумма операции": 146.0},
        {"Дата операции": "2021.05.03", "Сумма операции": 977.0},
    ]

@pytest.fixture
def get_not_operations_list___for_investment_bank():
    return 5

@pytest.fixture
def get_empty_operations_list___for_investment_bank():
    return []


@pytest.fixture
def get_faulty_operations_list___for_investment_bank():
    return [5, "fault"]
